OdDAI.ExplicitAttribute.isRedeclaredIn(OdDAI.Entity!System.Runtime.CompilerServices.IsConst*)
\details
Determines if attribute is redeclared by derived attribute of entity.
\returns Returns true if attribute redeclared by derived attribute of provided entity, otherwise returns false.

OdDAI.ExplicitAttribute.redeclaredIn
\details
Retrieves an array of entity definitions which attributes redeclare this explicit attribute.
\returns Returns an OdArray of raw pointers to OdDAI::Entity.

OdDAI.ExplicitAttribute.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.ExplicitAttribute.optional
\details
Determines whether the attribute is optional.
\returns Returns true if the attribute is optional; otherwise the method returns false.

OdDAI.ExplicitAttribute.domain
\details
Retrieves data type referenced by the attribute.
\returns Returns a smart pointer to the data type.

OdDAI.ExplicitAttribute.#ctor
\details
Creates a new attribute object with default parameters.

OdDAI.ExplicitAttribute
\details
A class that implements the storing and manipulating of attributes.